garyPenhook/PIC-Assembler/device_includes/pic16f17544.inc
// Register: APMCLKPPS
#define APMCLKPPS APMCLKPPS
APMCLKPPS                                equ 01E57h
// bitfield definitions
APMCLKPPS_APMCLKPPS_POSN                 equ 0000h
APMCLKPPS_APMCLKPPS_POSITION             equ 0000h
APMCLKPPS_APMCLKPPS_SIZE                 equ 0007h
APMCLKPPS_APMCLKPPS_LENGTH               equ 0007h
APMCLKPPS_APMCLKPPS_MASK                 equ 007Fh

// Register: PORTWIN0PPS
#define PORTWIN0PPS PORTWIN0PPS
PORTWIN0PPS                              equ 01E58h
// bitfield definitions
PORTWIN0PPS_PORTWIN0PPS_POSN             equ 0000h
PORTWIN0PPS_PORTWIN0PPS_POSITION         equ 0000h
PORTWIN0PPS_PORTWIN0PPS_SIZE             equ 0006h
PORTWIN0PPS_PORTWIN0PPS_LENGTH           equ 0006h
PORTWIN0PPS_PORTWIN0PPS_MASK             equ 003Fh

// Register: PORTWIN1PPS
#define PORTWIN1PPS PORTWIN1PPS
PORTWIN1PPS                              equ 01E59h
// bitfield definitions
PORTWIN1PPS_PORTWIN1PPS_POSN             equ 0000h
PORTWIN1PPS_PORTWIN1PPS_POSITION         equ 0000h
PORTWIN1PPS_PORTWIN1PPS_SIZE             equ 0006h
PORTWIN1PPS_PORTWIN1PPS_LENGTH           equ 0006h
PORTWIN1PPS_PORTWIN1PPS_MASK             equ 003Fh

// Register: PORTWCLKPPS
#define PORTWCLKPPS PORTWCLKPPS
PORTWCLKPPS                              equ 01E5Ah
// bitfield definitions
PORTWCLKPPS_PORTWCLKPPS_POSN             equ 0000h
PORTWCLKPPS_PORTWCLKPPS_POSITION         equ 0000h
PORTWCLKPPS_PORTWCLKPPS_SIZE             equ 0006h
PORTWCLKPPS_PORTWCLKPPS_LENGTH           equ 0006h
PORTWCLKPPS_PORTWCLKPPS_MASK             equ 003Fh

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 01E8Ch
// bitfield definitions
ANSELA_ANSELA0_POSN                      equ 0000h
ANSELA_ANSELA0_POSITION                  equ 0000h
ANSELA_ANSELA0_SIZE                      equ 0001h
ANSELA_ANSELA0_LENGTH                    equ 0001h
ANSELA_ANSELA0_MASK                      equ 0001h
ANSELA_ANSELA1_POSN                      equ 0001h
ANSELA_ANSELA1_POSITION                  equ 0001h
ANSELA_ANSELA1_SIZE                      equ 0001h
ANSELA_ANSELA1_LENGTH                    equ 0001h
ANSELA_ANSELA1_MASK                      equ 0002h
ANSELA_ANSELA2_POSN                      equ 0002h
ANSELA_ANSELA2_POSITION                  equ 0002h
ANSELA_ANSELA2_SIZE                      equ 0001h
ANSELA_ANSELA2_LENGTH                    equ 0001h
ANSELA_ANSELA2_MASK                      equ 0004h
ANSELA_ANSELA4_POSN                      equ 0004h
ANSELA_ANSELA4_POSITION                  equ 0004h
ANSELA_ANSELA4_SIZE                      equ 0001h
ANSELA_ANSELA4_LENGTH                    equ 0001h
ANSELA_ANSELA4_MASK                      equ 0010h
ANSELA_ANSELA5_POSN                      equ 0005h
ANSELA_ANSELA5_POSITION                  equ 0005h
ANSELA_ANSELA5_SIZE                      equ 0001h
ANSELA_ANSELA5_LENGTH                    equ 0001h
ANSELA_ANSELA5_MASK                      equ 0020h
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA5_POSN                        equ 0005h
ANSELA_ANSA5_POSITION                    equ 0005h
ANSELA_ANSA5_SIZE                        equ 0001h
ANSELA_ANSA5_LENGTH                      equ 0001h
ANSELA_ANSA5_MASK                        equ 0020h

// Register: WPUA
#define WPUA WPUA
WPUA                                     equ 01E8Dh
// bitfield definitions
WPUA_WPUA0_POSN                          equ 0000h
WPUA_WPUA0_POSITION                      equ 0000h
WPUA_WPUA0_SIZE                          equ 0001h
WPUA_WPUA0_LENGTH                        equ 0001h
WPUA_WPUA0_MASK                          equ 0001h
WPUA_WPUA1_POSN                          equ 0001h
WPUA_WPUA1_POSITION                      equ 0001h
WPUA_WPUA1_SIZE                          equ 0001h
WPUA_WPUA1_LENGTH                        equ 0001h
WPUA_WPUA1_MASK                          equ 0002h
WPUA_WPUA2_POSN                          equ 0002h
WPUA_WPUA2_POSITION                      equ 0002h
WPUA_WPUA2_SIZE                          equ 0001h
WPUA_WPUA2_LENGTH                        equ 0001h
WPUA_WPUA2_MASK                          equ 0004h
WPUA_WPUA3_POSN                          equ 0003h
WPUA_WPUA3_POSITION                      equ 0003h
WPUA_WPUA3_SIZE                          equ 0001h
WPUA_WPUA3_LENGTH                        equ 0001h
WPUA_WPUA3_MASK                          equ 0008h
WPUA_WPUA4_POSN                          equ 0004h
WPUA_WPUA4_POSITION                      equ 0004h
WPUA_WPUA4_SIZE                          equ 0001h
WPUA_WPUA4_LENGTH                        equ 0001h
WPUA_WPUA4_MASK                          equ 0010h
WPUA_WPUA5_POSN                          equ 0005h
WPUA_WPUA5_POSITION                      equ 0005h
WPUA_WPUA5_SIZE                          equ 0001h
WPUA_WPUA5_LENGTH                        equ 0001h
WPUA_WPUA5_MASK                          equ 0020h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 01E8Eh
// bitfield definitions
ODCONA_ODCA0_POSN                        equ 0000h
ODCONA_ODCA0_POSITION                    equ 0000h
ODCONA_ODCA0_SIZE                        equ 0001h
ODCONA_ODCA0_LENGTH                      equ 0001h
ODCONA_ODCA0_MASK                        equ 0001h
ODCONA_ODCA1_POSN                        equ 0001h
ODCONA_ODCA1_POSITION                    equ 0001h
ODCONA_ODCA1_SIZE                        equ 0001h
ODCONA_ODCA1_LENGTH                      equ 0001h
ODCONA_ODCA1_MASK                        equ 0002h
ODCONA_ODCA2_POSN                        equ 0002h
ODCONA_ODCA2_POSITION                    equ 0002h
ODCONA_ODCA2_SIZE                        equ 0001h
ODCONA_ODCA2_LENGTH                      equ 0001h
ODCONA_ODCA2_MASK                        equ 0004h
ODCONA_ODCA4_POSN                        equ 0004h
ODCONA_ODCA4_POSITION                    equ 0004h
ODCONA_ODCA4_SIZE                        equ 0001h
ODCONA_ODCA4_LENGTH                      equ 0001h
ODCONA_ODCA4_MASK                        equ 0010h
ODCONA_ODCA5_POSN                        equ 0005h
ODCONA_ODCA5_POSITION                    equ 0005h
ODCONA_ODCA5_SIZE                        equ 0001h
ODCONA_ODCA5_LENGTH                      equ 0001h
ODCONA_ODCA5_MASK                        equ 0020h

// Register: SLRCONA
#define SLRCONA SLRCONA
SLRCONA                                  equ 01E8Fh
// bitfield definitions
SLRCONA_SLRA0_POSN                       equ 0000h
SLRCONA_SLRA0_POSITION                   equ 0000h
SLRCONA_SLRA0_SIZE                       equ 0001h
SLRCONA_SLRA0_LENGTH                     equ 0001h
SLRCONA_SLRA0_MASK                       equ 0001h
SLRCONA_SLRA1_POSN                       equ 0001h
SLRCONA_SLRA1_POSITION                   equ 0001h
SLRCONA_SLRA1_SIZE                       equ 0001h
SLRCONA_SLRA1_LENGTH                     equ 0001h
SLRCONA_SLRA1_MASK                       equ 0002h
SLRCONA_SLRA2_POSN                       equ 0002h
SLRCONA_SLRA2_POSITION                   equ 0002h
SLRCONA_SLRA2_SIZE                       equ 0001h
SLRCONA_SLRA2_LENGTH                     equ 0001h
SLRCONA_SLRA2_MASK                       equ 0004h
SLRCONA_SLRA4_POSN                       equ 0004h
SLRCONA_SLRA4_POSITION                   equ 0004h
SLRCONA_SLRA4_SIZE                       equ 0001h
SLRCONA_SLRA4_LENGTH                     equ 0001h
SLRCONA_SLRA4_MASK                       equ 0010h
SLRCONA_SLRA5_POSN                       equ 0005h
SLRCONA_SLRA5_POSITION                   equ 0005h
SLRCONA_SLRA5_SIZE                       equ 0001h
SLRCONA_SLRA5_LENGTH                     equ 0001h
SLRCONA_SLRA5_MASK                       equ 0020h

